Julien-Arlandis/pinmame_native/esp32/esp_project/sdkconfig.defaults
# =========================================================================
# sdkconfig.defaults — ESP32-S3 + PSRAM pour PinMAME
# Adapter selon le module exact (PSRAM quad vs octal, taille flash)
# =========================================================================

# Cible
CONFIG_IDF_TARGET="esp32s3"

# ----- PSRAM -----
CONFIG_SPIRAM=y
# ESP32-S3-WROOM-1 N16R8 : PSRAM octal 8-bit
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Met automatiquement les variables .bss annotées EXT_RAM_BSS_ATTR en PSRAM
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Les petites allocations (<16KB) restent en SRAM interne (plus rapide)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=65536
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_USE_MALLOC=y

# ----- CPU -----
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# ----- FreeRTOS -----
CONFIG_FREERTOS_HZ=1000
# Stack de la tâche principale (app_main) — petite, on crée notre propre tâche
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# ----- Flash & partitions -----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ----- Optimisation -----
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Désactiver la vérification de stack overflow sur la tâche PinMAME (profond)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE=y

# ----- RTC -----
# La RTC FAST memory (8KB, 0x600fe000-0x60100000) ne doit pas servir de heap
# général : un SRC_STATE de libsamplerate y a été alloué et corrompu en cours
# de partie (IntegerDivideByZero dans calc_output_single), région trop petite
# et probablement disputée par le BLE/PHY pour y placer des objets durables.
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n

# ----- Logs -----
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y

# ----- NVS -----
CONFIG_NVS_ENCRYPTION=n

# ----- BLE (NimBLE) -----
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# MTU étendu : 247 → 244 octets utiles par notification (moins de chunks)
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
# NimBLE en PSRAM — libère la SRAM interne pour USB DMA + stack PinMAME
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# ----- Console UART (Port B / CH343P) — libère Port A (GPIO19/20) pour USB OTG -----
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
